CREATE OR REPLACE PROCEDURE prc_LoadSampleData()
LANGUAGE plpgsql
AS $$
BEGIN
    INSERT INTO contract (number_contract, date, provider_contract, legal_address_contract, okpo_contract, bic_contract, 
	representative_contract, id_contract) VALUES 
    ('№: ДП-00000001-23/25' , '10.02.2023', '«Формацевт Помощь»', 'г. Москва, ул. Серпуховская д.15, стр. 1', 'г. Москва, ул. Третьяковская, д. 76, к. 2', '5902256721', '054262167', 'Семёнов Игорь Аркадьевич'), 
    ('№: ДП-00000001-23/26', '15.03.2023', '«Аптека - доставка»', 'г. Москва, ул. Арбатская, д. 83, стр.3', 'г. Москва, ул. Савёловская, д. 9, к. 6', '7227823125', '726980532', 'Николаев Сергей Валерьевич');


    INSERT INTO worker (login_worker, password_worker, id_worker) VALUES 
    ('IvanovII', 'PaSSword', 1),
    ('PetrovPP', 'PaSSword', 2),
	('DmitrievDD', 'PaSSword', 3);

    INSERT INTO credentials (login_credentials, name_credentials, last_name_credentials, middle_name_credentials) VALUES 
    ('IvanovII', 'Иван ', 'Иванов ', 'Иванович'),
    ('PetrovPP', 'Петр', 'Петров ', 'Петрович'),
	('DmitrievDD', 'Дмитрий', 'Дмитриев', 'Дмитриевич'),
    ('AlekseevMA', 'Максим ', 'Алексеев', 'Анатольевич'),
    ('IvanovaID', 'Ирина', 'Иванова', 'Дмитриевна '),
    ('VladimirovAK', 'Андрей', 'Владимиров', 'Кириллович'),
    ('GeorgievVV', 'Георгиев', 'Владимир', 'Валерьевич');

    INSERT INTO background_information (article_back, country_back, marking_back, manufacturer_back, structure_back,
	from_whatr_back, id_background_information) VALUES 
    ('ЛП-0000001', 'Россия', 'Препарат+', 'ФормаПрод', 'Натуральные цитрусовые и травяные компоненты, натуральная оболочка.', 'От боли в суставах.'),
    ('ЛП-0000002', 'Турция', 'Фармакология', 'ГенИнжен', 'Витаминный комплекс, растительный состав.', 'От головной и прочей боли.'),
	('ЛП-0000003', 'Россия', 'Нужная помощь', 'ХиллОлл', 'Биологические элементы, пищевая оболочка.', 'Профилактика ОРВИ.'),
    ('ЛП-0000004', 'Турция', 'Фармакология', 'ГенИнжен', 'Натуральные жиры и масла.', 'От мышечной боли.'),
	('ЛП-0000005', 'Россия', 'Препарат+', 'ФормаПрод', 'Бифитобактерии, микроэлементы.', 'Профилактика аллергии.'),
    ('ЛП-0000006', 'Россия', 'Фармакология', 'ГенИнжен', 'Ферменты масел, ферменты микроэлементов', 'Снятие отёков.'),
	('ЛП-0000006', 'Белоруссия', 'Фармакология', 'ГенИнжен', 'Натуральные масла.', 'От мышечного растяжения.');

    INSERT INTO client (
        login_client, password_client, oms_client, 
        passport_details_client, contact_phone_client, address_client, pension_certificate_client,
		statusdisability_certificate_client, id_client) VALUES 
    ('AlekseevMA', 'PaSSword', '0036 3306 2912 2000', '46 32 723547', '+7(943)733-82-16', 'г. Москва, ул. Полежаевская, д. 2, стр. 4', '-', '-'),
	('IvanovaID', 'PaSSword', '0226 8963 3004 1950', '46 11 885247', '+7(983)772-15-11', 'г. Москва, ул. Сокол, д. 53, к. 6', '643-677-573-14', '-'),
	('VladimirovAK', 'PaSSword', '1654 7733 0801 1999', '43 66 787136', '+7(992)528-14-83', 'г. Москва, ул. Павелецкая, д .6, стр. 12', '-', '-'),
    ('GeorgievVV', 'PaSSword', '1753 4266 0106 1965', '45 77 992217', '+7(924)662-72-12', 'г. Москва, ул. Ломоносовская, д.104, к. 1.', '0004524661', '-');

    INSERT INTO estimate (number_estimate, date_estimate, positions_for_delivery_estimate, quantity_estimate,
	cost_estimate, status_order_estimate, number_order, id_estimate) VALUES 
    ('СнП-000000001/23', '01.09.2023', 'ЛП-0000001', '250 уп.', '100000 р.', '«Закрытый»', 'ЗК000000001', '1'),
	('СнП-000000002/23', '01.09.2023', 'ЛП-0000003', '250 уп.', '292500 р.', '«Закрытый»', 'ЗК000000002', '2'),
    ('СнП-000000003/23', '04.09.2023', 'ЛП-0000004', '300 уп.', '603000 р.', 'В обработке»', 'ЗК000000003', '3');


    INSERT INTO indications_contraindications (acrticle_indications_contraindications, indications, contraindications,
	id_indications_contraindications) VALUES 
    ('ЛП-0000001', 'Острая или тянущая боль в областях локтей.', 'Аллергия на витамин С.', '1'),
	('ЛП-0000002', 'Пульсирующая боль в височной области.', 'Не переносимость гамма элементов.', '2'),
    ('ЛП-0000003', 'Кашель, сонливость, выделения из носовой полости.', 'Сердечная слабость.', '3'),
	('ЛП-0000004', 'Растяжения, ушибы. ', 'Почечная недостаточность. ', '4'),
    ('ЛП-0000005', 'Заложенность носа, покраснения конечностей и глаз.', 'Расстройство желудка. ', '5'),
	('ЛП-0000006', 'Отёк конечностей.', 'Непереносимость глюкозы.', '6'),
	('ЛП-0000007', 'Тянущая и ноющая боль в сгибах. ', 'Аллергия на травы. ', '7');

    INSERT INTO med_product_order (article_med, number_order, id_med_products_order) VALUES 
    ('ЛП-0000001', 'ЗК000000001', '1'),
    ('ЛП-0000002', 'ЗК000000002', '2'),
	('ЛП-0000003', 'ЗК000000001', '3'),
    ('ЛП-0000004', 'ЗК000000003', '4'),
	('ЛП-0000005', 'ЗК000000002', '5'),
    ('ЛП-0000006', 'ЗК000000001', '6'),
	('ЛП-0000007', 'ЗК000000003', '7');
	
	INSERT INTO med_product (article_med, name_med, quantity_med, price_med, id_med_product) VALUES 
    ('ЛП-0000001', 'Авапасипам', '200', '150', 1),
    ('ЛП-0000002', 'Фротувазол', '120', '1200', 2),
	('ЛП-0000003', 'Валокардолин', '345', '250', 3),
    ('ЛП-0000004', 'Редрогедоран', '100', '950', 4),
	('ЛП-0000005', 'Рамеростам', '76', '540', 5),
    ('ЛП-0000006', 'Картитозанол', '240', '470', 6),
	('ЛП-0000007', 'Флютозипам', '80', '140', 7);

	INSERT INTO order_ (number_order, data_order, time_order, pharmacist_order, 
	receipt_number_order, discount_order, number_contract_order, id_order) VALUES 
    ('ЗК000000001', 'Авапасипам', '11.09.2023', '12:09:43', 'IvanovII', '+7(943)733-82-16', '0','№: ДП-00000001-23/25 ', 1),
    ('ЗК000000002', 'Фротувазол', '15.09.2023 ', '17:29:23', 'IvanovII', '+7(983)772-15-11', '20','№: ДП-00000001-23/25 ', 2),
	('ЗК000000003', 'Валокардолин', '12.09.2023', '-', 'PetrovPP', '+7(924)662-72-12', '25', '№: ДП-00000001-23/26',3),
    ('ЗК000000004', 'Редрогедоран', '17.09.2023 ', '18:23:59','DmitrievDD', '+7(992)528-14-83', '0','№: ДП-00000001-23/25 ', 4),
	('ЗК000000005', 'Рамеростам', '15.09.2023 ', '13:09:33','DmitrievDD', '+7(992)528-14-83', '20','№: ДП-00000001-23/26', 5);

END;
$$;
